0_org/Cs
// 中文说明：悬沙体积分数 Cs 的初始值和入口、出口、壁面边界条件。
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cs;
}

dimensions    [0 0 0 0 0 0 0];
internalField uniform 0;

boundaryField
{
    inlet
    {
        // Clean-water inflow.
        type  fixedValue;
        value uniform 0;
    }
    outlet
    {
        type zeroGradient;
    }
    top
    {
        type symmetryPlane;
    }
    bed
    {
        type zeroGradient;
    }
    sideWalls
    {
        type zeroGradient;
    }
}
