0_org/U
// 中文说明：水流速度 U 的初始场与 0.50 m/s 来流边界条件。
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions    [0 1 -1 0 0 0 0];
internalField uniform (0.50 0 0);

boundaryField
{
    inlet
    {
        type  fixedValue;
        value uniform (0.50 0 0);
    }
    outlet
    {
        type zeroGradient;
    }
    top
    {
        type symmetryPlane;
    }
    bed
    {
        // Required on a moving sediment boundary.
        type  movingWallVelocity;
        value uniform (0 0 0);
    }
    sideWalls
    {
        type noSlip;
    }
}
