0_org/finite-area/rigidBed
// 中文说明：不可冲刷刚性底板位置，限制可动砂层最大冲刷深度为 0.05 m。
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaVectorField;
    location    "0/finite-area";
    object      rigidBed;
}

// The initial mobile sediment layer is 0.05 m thick: bed z=0, rigid z=-0.05.
dimensions    [0 1 0 0 0 0 0];
internalField uniform (0 0 -0.05);

boundaryField
{
    inletFa
    {
        type zeroGradient;
    }
    outletFa
    {
        type zeroGradient;
    }
    sideWallsFa
    {
        type zeroGradient;
    }
    defaultFa
    {
        type zeroGradient;
    }
}
