0_org/omega
// 中文说明：比耗散率 omega 的初始场及 k-omega SST 边界条件。
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

// omega from 5% turbulence intensity and a 0.0035 m turbulence length scale.
dimensions    [0 0 -1 0 0 0 0];
internalField uniform 16.0;

boundaryField
{
    inlet
    {
        type  fixedValue;
        value uniform 16.0;
    }
    outlet
    {
        type zeroGradient;
    }
    top
    {
        type symmetryPlane;
    }
    bed
    {
        type  omegaWallFunction;
        value uniform 16.0;
    }
    sideWalls
    {
        type  omegaWallFunction;
        value uniform 16.0;
    }
}
