0_org/p
// 中文说明：运动压力 p 的初始场与入口、出口和壁面压力边界条件。
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions    [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type  fixedValue;
        value uniform 0;
    }
    top
    {
        type symmetryPlane;
    }
    bed
    {
        type     fixedFluxPressure;
        gradient uniform 0;
    }
    sideWalls
    {
        type     fixedFluxPressure;
        gradient uniform 0;
    }
}
