0_org/pointDisplacement
// 中文说明：床面点位移初始场；Exner 床形变化通过该场驱动动态网格。
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}

dimensions    [0 1 0 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
    inlet
    {
        type  fixedValue;
        value uniform (0 0 0);
    }
    outlet
    {
        type  fixedValue;
        value uniform (0 0 0);
    }
    top
    {
        type symmetryPlane;
    }
    bed
    {
        // sedExnerFoam updates this boundary according to the Exner equation.
        type  fixedValue;
        value uniform (0 0 0);
    }
    sideWalls
    {
        type  fixedValue;
        value uniform (0 0 0);
    }
}
