Allmesh
#!/bin/sh
# 中文说明：生成全域 1 mm 体网格、有限面积床面和接触积分点，并检查网格质量。
# Generate the uniform 1 mm mesh and its finite-area Exner bed.

cd "${0%/*}" || exit 1

if [ -z "${WM_PROJECT_DIR:-}" ]; then
    . /usr/lib/openfoam/openfoam2412/etc/bashrc
fi

set -e
rm -rf constant/polyMesh constant/faMesh

# This generator keeps the 50 x 50 x 50 topology deterministic and avoids a
# hand-written 125,000-cell dictionary.
python3 make_variable_mesh.py
python3 make_contact_quadrature.py
blockMesh > log.blockMesh 2>&1
checkMesh > log.checkMesh 2>&1
makeFaMesh > log.makeFaMesh 2>&1
checkFaMesh > log.checkFaMesh 2>&1

touch yangtzeIronBlock3D_1mm60s.foam
echo "Uniform 1 mm immersed-boundary mesh completed"
