Allrun63s
#!/bin/sh
# 中文说明：执行完整生产流程，包括建网、3 s 启动和 60 s 水沙床面刚体耦合。
# Rebuild, spin up for 3 s, then run 60 physical seconds of coupled motion.

cd "${0%/*}" || exit 1

if [ -z "${WM_PROJECT_DIR:-}" ]; then
    . /usr/lib/openfoam/openfoam2412/etc/bashrc
fi

set -e

# Defaults match the desktop; an HPC allocation can export NPROCS and reuse an
# already checked mesh with SKIP_MESH=1.
NPROCS="${NPROCS:-6}"
SKIP_MESH="${SKIP_MESH:-0}"

# Keep the six-face contact integration deterministic on every platform.
python3 make_contact_quadrature.py

# Reject inconsistent production dictionaries before spending days of CPU.
python3 validate_case.py

# The decomposed history plus final reconstruction needs substantial scratch.
available_kb=$(df -Pk . | awk 'NR==2 {print $4}')
required_kb=$((5 * 1024 * 1024))
if [ "$available_kb" -lt "$required_kb" ]; then
    echo "At least 5 GiB free space is required; refusing to start." >&2
    exit 1
fi

if [ "$SKIP_MESH" != "1" ]; then
    ./Allmesh
fi
foamListTimes -rm >/dev/null 2>&1 || true
foamListTimes -processor -rm >/dev/null 2>&1 || true
rm -rf 0 postProcessing
cp -r 0_org 0

# Split only in x/y so every MPI rank owns a balanced part of the Exner bed.
python3 set_decomposition.py "$NPROCS"
decomposePar -force > log.decomposePar 2>&1

if [ -n "${SLURM_JOB_ID:-}" ]; then
    srun immersedSedExnerFoam -parallel \
        > log.immersedSedExnerFoam.63s 2>&1
else
    mpirun ${MPI_EXTRA_ARGS:-} -np "$NPROCS" \
        immersedSedExnerFoam -parallel \
        > log.immersedSedExnerFoam.63s 2>&1
fi

# Preserve disk space: all partitioned snapshots remain available for a
# decomposed ParaView time series, while only the final global state is made.
reconstructPar -latestTime > log.reconstructPar 2>&1
