AllrunCouplingSmoke
#!/bin/sh
# 中文说明：用极短计算验证输沙、床面更新、接触和六自由度耦合分支是否可运行。
# Validate the sediment exchange, Exner update, contact and 6-DoF branches.
# The production dictionaries are restored automatically on every exit path.

cd "${0%/*}" || exit 1

if [ -z "${WM_PROJECT_DIR:-}" ]; then
    . /usr/lib/openfoam/openfoam2412/etc/bashrc
fi

set -e
NPROCS="${NPROCS:-6}"
SMOKE_ENDTIME="${SMOKE_ENDTIME:-0.0003}"
SMOKE_WRITE_INTERVAL="${SMOKE_WRITE_INTERVAL:-0.05}"

control_backup=$(mktemp)
body_backup=$(mktemp)
cp system/controlDict "$control_backup"
cp constant/immersedBodyProperties "$body_backup"

restore_production()
{
    if [ -f "$control_backup" ]; then
        cp "$control_backup" system/controlDict
        rm -f "$control_backup"
    fi
    if [ -f "$body_backup" ]; then
        cp "$body_backup" constant/immersedBodyProperties
        rm -f "$body_backup"
    fi
    python3 set_decomposition.py 6 >/dev/null
}
trap restore_production EXIT INT TERM

foamListTimes -rm >/dev/null 2>&1 || true
foamListTimes -processor -rm >/dev/null 2>&1 || true
rm -rf 0 postProcessing
cp -r 0_org 0

# Release both branches immediately, but integrate only two tiny steps.
foamDictionary system/controlDict -entry endTime -set "$SMOKE_ENDTIME" >/dev/null
foamDictionary system/controlDict \
    -entry writeInterval -set "$SMOKE_WRITE_INTERVAL" >/dev/null
foamDictionary constant/immersedBodyProperties \
    -entry releaseTime -set 0 >/dev/null
foamDictionary constant/immersedBodyProperties \
    -entry sedimentReleaseTime -set 0 >/dev/null
python3 set_decomposition.py "$NPROCS" >/dev/null

decomposePar -force > log.decomposePar.couplingSmoke 2>&1
/usr/bin/time -v mpirun ${MPI_EXTRA_ARGS:-} -np "$NPROCS" \
    immersedSedExnerFoam -parallel \
    > log.couplingSmoke 2> log.couplingSmoke.resources

echo "Coupling smoke test completed; production dictionaries restored"
