AllrunSmoke
#!/bin/sh
# 中文说明：进行六进程短时冒烟测试和性能基准，退出时自动恢复正式参数。
# Short six-rank validation/benchmark. It changes endTime only temporarily.

cd "${0%/*}" || exit 1

if [ -z "${WM_PROJECT_DIR:-}" ]; then
    . /usr/lib/openfoam/openfoam2412/etc/bashrc
fi

set -e
NPROCS="${NPROCS:-6}"
SMOKE_ENDTIME="${SMOKE_ENDTIME:-0.0003}"

control_backup=$(mktemp)
cp system/controlDict "$control_backup"

# Always restore the production end time even if MPI or a solver check fails.
restore_control()
{
    if [ -f "$control_backup" ]; then
        cp "$control_backup" system/controlDict
        rm -f "$control_backup"
    fi
    python3 set_decomposition.py 6 >/dev/null
}
trap restore_control EXIT INT TERM

foamListTimes -rm >/dev/null 2>&1 || true
foamListTimes -processor -rm >/dev/null 2>&1 || true
rm -rf 0 postProcessing
cp -r 0_org 0

foamDictionary system/controlDict -entry endTime -set "$SMOKE_ENDTIME" >/dev/null
python3 set_decomposition.py "$NPROCS" >/dev/null
decomposePar -force > log.decomposePar.smoke 2>&1

# /usr/bin/time records peak resident memory for feasibility assessment.
/usr/bin/time -v mpirun ${MPI_EXTRA_ARGS:-} -np "$NPROCS" \
    immersedSedExnerFoam -parallel \
    > log.smoke 2> log.smoke.resources

echo "Smoke test completed; production endTime restored to 63 s"
