constant/contactQuadrature
// 中文说明：铁块六个面的接触积分点、外法向和面积权重，由脚本自动生成。
// Generated by make_contact_quadrature.py; do not edit by hand.
contactPoints
(
    (0.02 0.02 0)
    (0.02 0.02 0.01)
    (0.02 0.02 0.02)
    (0.02 0.025 0)
    (0.02 0.025 0.01)
    (0.02 0.025 0.02)
    (0.02 0.03 0)
    (0.02 0.03 0.01)
    (0.02 0.03 0.02)
    (0.03 0.02 0)
    (0.03 0.02 0.01)
    (0.03 0.02 0.02)
    (0.03 0.025 0)
    (0.03 0.025 0.01)
    (0.03 0.025 0.02)
    (0.03 0.03 0)
    (0.03 0.03 0.01)
    (0.03 0.03 0.02)
    (0.02 0.02 0)
    (0.02 0.02 0.01)
    (0.02 0.02 0.02)
    (0.025 0.02 0)
    (0.025 0.02 0.01)
    (0.025 0.02 0.02)
    (0.03 0.02 0)
    (0.03 0.02 0.01)
    (0.03 0.02 0.02)
    (0.02 0.03 0)
    (0.02 0.03 0.01)
    (0.02 0.03 0.02)
    (0.025 0.03 0)
    (0.025 0.03 0.01)
    (0.025 0.03 0.02)
    (0.03 0.03 0)
    (0.03 0.03 0.01)
    (0.03 0.03 0.02)
    (0.02 0.02 0)
    (0.02 0.025 0)
    (0.02 0.03 0)
    (0.025 0.02 0)
    (0.025 0.025 0)
    (0.025 0.03 0)
    (0.03 0.02 0)
    (0.03 0.025 0)
    (0.03 0.03 0)
    (0.02 0.02 0.02)
    (0.02 0.025 0.02)
    (0.02 0.03 0.02)
    (0.025 0.02 0.02)
    (0.025 0.025 0.02)
    (0.025 0.03 0.02)
    (0.03 0.02 0.02)
    (0.03 0.025 0.02)
    (0.03 0.03 0.02)
);

contactNormals
(
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (-1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (1 0 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 -1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 1 0)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 -1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
    (0 0 1)
);

contactPointAreas
(
    1.25e-05
    2.5e-05
    1.25e-05
    2.5e-05
    5e-05
    2.5e-05
    1.25e-05
    2.5e-05
    1.25e-05
    1.25e-05
    2.5e-05
    1.25e-05
    2.5e-05
    5e-05
    2.5e-05
    1.25e-05
    2.5e-05
    1.25e-05
    1.25e-05
    2.5e-05
    1.25e-05
    2.5e-05
    5e-05
    2.5e-05
    1.25e-05
    2.5e-05
    1.25e-05
    1.25e-05
    2.5e-05
    1.25e-05
    2.5e-05
    5e-05
    2.5e-05
    1.25e-05
    2.5e-05
    1.25e-05
    6.25e-06
    1.25e-05
    6.25e-06
    1.25e-05
    2.5e-05
    1.25e-05
    6.25e-06
    1.25e-05
    6.25e-06
    6.25e-06
    1.25e-05
    6.25e-06
    1.25e-05
    2.5e-05
    1.25e-05
    6.25e-06
    1.25e-05
    6.25e-06
);
