constant/fvOptions
// 中文说明：OpenFOAM 体源项配置；当前为空，保留标准接口。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}

// No body-force source is needed: velocity is imposed at the inlet.
