constant/g
// 中文说明：定义重力加速度的方向和大小。
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions [0 1 -2 0 0 0 0];
value      (0 0 -9.80665);
