constant/immersedBodyProperties
// 中文说明：铁块几何、质量、六自由度、接触、摩擦、阻尼和水平限位参数。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      immersedBodyProperties;
}

// Analytic homogeneous iron cuboid, 0.01 x 0.01 x 0.02 m.
halfSize                  (0.005 0.005 0.010);

// Brinkman relaxation and a two-cell transition on the 1 mm core mesh.
penaltyTime               0.0002;
interfaceThickness        0.0010;

// The central 70% of the footprint is protected from artificial Exner shear;
// the 15 mm edge band remains active so hydraulic undercutting can occur.
sedimentMaskHalfFraction  0.70;

// Hold the block fixed during the 3 s spin-up so the immersed-boundary flow
// can establish without applying a non-physical start-up impulse.
releaseTime               3.0;
sedimentReleaseTime       3.0;

// Parallel-safe bed contact. Six oriented face quadratures follow the cuboid
// through translation/rotation; nearest bed elevation is reduced across MPI.
contactProperties
{
    contactArea          0.0001;
    // A compliant, over-damped dense-sand foundation.  This avoids the
    // non-physical rebound produced by treating the bed like a steel plate.
    foundationStiffness  5.0e6;
    dampingRatio         1.20;
    staticFriction       0.52;
    dynamicFriction      0.42;
    frictionVelocity     0.01;
    bearingCapacity      1.8e4;
    searchRadius         0.003;

    // Buoyancy uses the body-mask volume actually inside the water mesh.
    fluidDensity         999;

    // Generated six-face quadrature: points, outward body-frame normals and
    // tributary surface areas.  Projected area changes correctly after tip.
    #include "contactQuadrature"
}

// A body-only retaining frame represents the specimen cage in this very short
// 5 cm test section. Water still enters/exits through the original boundaries.
// The block remains free inside the frame and can translate, roll and tip.
retainerProperties
{
    // Keep the smoothed solid mask at least two interface thicknesses away
    // from inlet/outlet/side-wall boundary conditions.
    min             (0.003 0.003 -1);
    max             (0.047 0.047 1);
    activeAxes      (1 1 0);
    stiffness       200;
    dampingRatio    1.20;
    maxForce        2.0;
}

// Safety bounds are deliberately much wider than the expected inlet values
// (k=9.375e-4 m2/s2, omega=16 1/s, nut~1e-5--1e-3 m2/s). They only prevent a
// distorted moving-mesh cell from seeding an unbounded RANS feedback loop.
stabilityProperties
{
    kMin        1e-10;
    kMax        1.0;
    omegaMin    1.0;
    omegaMax    1e5;
    nutMax      0.01;
}

sixDoFCoeffs
{
    centreOfMass       (0.025 0.025 0.010);
    mass               0.01574;
    momentOfInertia    (6.55833e-7 6.55833e-7 2.62333e-7);
    velocity           (0 0 0);
    acceleration       (0 0 0);
    angularMomentum    (0 0 0);
    torque             (0 0 0);
    orientation        (1 0 0 0 1 0 0 0 1);

    accelerationRelaxation 0.3;
    accelerationDamping    1.0;
    report                 no;

    // Small-scale hydrodynamic/contact motion needs resolved dissipation.
    // These coefficients give about 0.31 s translational and 0.02 s angular
    // decay times for the 15.74 g iron block, while preserving all six DoF.
    restraints
    {
        translationDamper
        {
            sixDoFRigidBodyMotionRestraint linearDamper;
            coeff 0.05;
        }
        rotationDamper
        {
            sixDoFRigidBodyMotionRestraint sphericalAngularDamper;
            coeff 3.0e-5;
        }
    }

    solver
    {
        type Newmark;
        gamma 0.5;
        beta  0.25;
    }
}
