constant/turbulenceProperties
// 中文说明：选择不可压 RANS 与 k-omega SST 湍流模型。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

// Depth-based Reynolds number is about 2.19e4, so a RANS baseline is used.
simulationType RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
