system/blockMeshDict
// 中文说明：定义 0.05 m×0.05 m×0.05 m 水体的全域 1 mm 正交六面体网格。
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

// Generated by make_variable_mesh.py. Do not edit this file by hand.
scale 1;

vertices
(
    (0.00000 0.00000 0.00000)
    (0.05000 0.00000 0.00000)
    (0.00000 0.05000 0.00000)
    (0.05000 0.05000 0.00000)
    (0.00000 0.00000 0.05000)
    (0.05000 0.00000 0.05000)
    (0.00000 0.05000 0.05000)
    (0.05000 0.05000 0.05000)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 50 50) simpleGrading (1.0 1.0 1.0)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)
        );
    }
    bed
    {
        type wall;
        faces
        (
            (2 3 1 0)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 7 6)
        );
    }
    sideWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (6 7 3 2)
        );
    }
);

mergePatchPairs ();
