system/controlDict
// 中文说明：控制求解器、63 s 物理时间、自适应步长、输出和诊断函数。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     immersedSedExnerFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;

// 3 s hydrodynamic spin-up + 60 s coupled sediment/body simulation.
endTime         63;
deltaT          0.0001;

// Write snapshots frequently enough for near-real-time ParaView refresh.
writeControl    adjustableRunTime;
writeInterval   2.0;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
// OpenFOAM disables compression for binary fields; keep this explicit.
writeCompression off;
timeFormat      general;
timePrecision   8;

runTimeModifiable true;
adjustTimeStep    true;
maxCo             0.20;
// Resolve the 0.0002 s Brinkman relaxation time; U=0.50 m/s then gives a
// nominal cell Courant number of 0.10 on the uniform 1 mm mesh.
maxDeltaT         0.0002;

functions
{
    // Rough-wall resolution check; values are written only with CFD output.
    yPlusBed
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        patches         (bed sideWalls);
        writeFields     yes;
        executeControl  writeTime;
        writeControl    writeTime;
    }

    // Resolved bed shear is a primary calibration observable for entrainment.
    bedWallShear
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (bed);
        log             yes;
        writeFields     yes;
        writeToFile     yes;
        executeControl  writeTime;
        writeControl    writeTime;
    }

    // Catch divergence, negative turbulence fields and concentration spikes.
    fieldBounds
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (U p k omega Cs bodyMask);
        executeControl  writeTime;
        writeControl    writeTime;
    }
}
