system/decomposeParDict
// 中文说明：并行分区只沿水平面切分，使每个分区都贯穿水深并拥有床面。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Generated by set_decomposition.py. Every rank spans the full water depth.
numberOfSubdomains 6;
method hierarchical;

hierarchicalCoeffs
{
    n       (3 2 1);
    delta   0.001;
    order   xyz;
}
