system/finite-area/faSchemes
// 中文说明：规定有限面积床面方程的时间、梯度、散度和拉普拉斯离散格式。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}

ddtSchemes           {}
gradSchemes          {}
divSchemes           {}
laplacianSchemes     {}
interpolationSchemes {}
lnGradSchemes        {}
