system/finite-area/faSolution
// 中文说明：规定有限面积床面方程的线性求解器、容差和算法控制。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSolution;
}

solvers
{
    Zb
    {
        solver          PBiCG;
        preconditioner  DILU;
        minIter         0;
        maxIter         2000;
        tolerance       1e-7;
        relTol          0;
    }
}

PISO
{
    nCorrectors               2;
    nNonOrthogonalCorrectors  1;
}
