system/fvSchemes
// 中文说明：规定三维流场和悬沙方程的有限体积离散格式。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss linearUpwind phi;
    div(phip,Cs)                    Gauss upwind phip;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div(phi,k)                      Gauss limitedLinear 1;
    div(phi,omega)                  Gauss limitedLinear 1;
    div(phi,epsilon)                Gauss limitedLinear 1;
}

laplacianSchemes
{
    default Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}

fluxRequired
{
    default no;
    p;
    Cs;
}

wallDist
{
    method meshWave;
}
