system/fvSolution
// 中文说明：规定压力、速度、湍流和悬沙方程求解器及 PIMPLE 控制参数。
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.05;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
        relTol 0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance 1e-8;
        relTol    0;
    }

    // Pressure correction used immediately after mesh motion.
    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        tolerance 1e-8;
        relTol    0;
    }

    "(k|omega|Cs)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(kFinal|omegaFinal|CsFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor          1;
    nOuterCorrectors           2;
    nCorrectors                3;
    nNonOrthogonalCorrectors   1;
    pRefPoint                  (0.025 0.025 0.025);
    pRefValue                  0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 2;
    PhiRefPoint (0.025 0.025 0.025);
    PhiRefValue 0;
}
